import yfinance as yf
import streamlit as st
import pandas as pd
from PIL import Image

st. set_page_config(layout="wide")
st.markdown('<style>.block-container {direction : rtl}</style>',
            unsafe_allow_html=True)


image = Image.open('./imps-logo.jpg')
st.image(image, width=100)


#with open( "./style.css" ) as css:
    #st.markdown( f'<style>{css.read()}</style>' , unsafe_allow_html= True)

#with st.sidebar:
#    st.sidebar.title('انتحاب شاخص های مناسب')
#    st.write("This code will be printed to the sidebar.")

tab1_title = '<p style="font-family:B Titr; color:White; font-size: 52px;">بازار کار</p>'
#st.markdown(tab1_title, unsafe_allow_html=True)

tab1, tab2, tab3, tab4 = st.tabs(
    ["👷 بازار کار",
     "🛠 صنعت",
     "🚢 تجارت",
     "💰 بودجه خانوار"]
)

with tab1:
#    st.header("بازار کار")
#    st.image("https://static.streamlit.io/examples/cat.jpg", width=200)

    col1, col2 = st.columns([1, 5])

    with col1:
        with st.expander("شاخص ها"):
            st.write("جمعیت در سن کار")
            st.write("جمعیت فعال")
            st.write("جمعیت غیر فعال")
            st.write("جمعیت شاغل")
            st.write("جمعیت بیکار")
            st.write("نرخ مشارکت")
            st.write("برخ بیکاری")
            st.write("نسبت اشتغال")

        with st.expander("استان"):
            Tickers = [
                'ETH-USD',
                'TSLA',
                'BTC-USD',
                "آذربایجان شرقی",
                "آذربایجان غربی",
                "اردبیل",
                "اصفهان",
                "البرز",
                "ایلام",
                "بوشهر",
                "تهران ",
                "چهارمحال و بختیاری",
                "خراسان جنوبی",
                "خراسان رضوی",
                "خراسان شمالی",
                "خوزستان",
                "زنجان",
                "سمنان",
                "سیستان و بلوچستان",
                "فارس",
                "قزوین",
                "قم",
                "کردستان",
                "کرمان",
                "کرمانشاه",
                "کهگیلویه و بویراحمد",
                "گلستان",
                "گیلان",
                "لرستان",
                "مازندران",
                "مرکزی",
                "هرمزگان",
                "همدان",
                "یزد"]
            t1dropdown = st.multiselect(
                'استان یا استان های مورد نظر خود را انتحاب کنید',
                Tickers, key=1)

        with st.expander("زمان"):
            start = st.date_input('از تاریخ',
                                  value=pd.to_datetime('2022-01-01'), key='st1')
            end = st.date_input('تا تاریخ',
                                value=pd.to_datetime('today'), key ='et1')

        with st.expander("سبد علایق کاربر"):
            st.write("sfsf")
            st.write("sfsf")

        with st.expander("محاسبه شاخص های جدید"):
            st.write("sfsf")
            st.write("sfsf")

    with col2:
        c2tab1, c2tab2, c2tab3, c2tab4, c2tab5 = st.tabs([
            "نمودار", "جدول", "فراداده ها", "گزینه های دانلود" ,
            "اشتراک گزاری" ])

        with c2tab1:
            if len(t1dropdown) > 0:
                df = yf.download(t1dropdown, start, end)['Close']
                st.line_chart(df)

        with c2tab2:
            if len(t1dropdown) > 0:
                data = yf.download(t1dropdown, start, end)
                st.table(data)

        with c2tab3:
#st.image("https://static.streamlit.io/examples/owl.jpg", width=200)
            st.write(
                """
نیروی کار:

اطلاعاتي‌ كه‌ در ايـن‌ قسمت‌ ارائه‌ مي‌شــود شـامـل‌ انـواع جمعيـت‌ فـعال‌ و غيرفعـال اقتصــادي، ويژگي‌هاي‌ جمعيت‌ شاغل‌ در بخش‌هاي‌ مختـلف‌ اقتصـادي‌، شاخص های عمده نیروی کار، نرخ مشارکت اقتصادی و نرخ بیکاری و  ... می باشد.

آمار و اطلاعات‌ مربوط به‌ نيروي‌ انساني‌، براي‌ نخستين‌ بار در سال‌ 1318 توسط اداره‌ كل‌ آمار و ثبت‌ احوال‌، در برخي‌ از شهرهاي ‌مهم ‌كشورگردآوري ‌شد. در سال‌ 1335، ضمن‌ اجراي‌ اولين ‌سرشماري‌ عمومي‌ نفوس‌ كه‌ توسط اداره‌ كل‌ آمار عمومي‌ اجرا شد، اطلاعاتي‌ چند در اين‌ زمينه‌ به‌ دست‌ آمد. سپس‌ با اجراي ‌چند طرح ‌آماري‌ در زمينه‌‌هاي كشاورزي‌، صنعت‌ و جمعيت‌، در زمره‌ آمار جمع‌آوري‌ شده‌، اطلاعات مربوط‌ به‌ نيروي‌ انساني‌ نيز متناسب‌ با موضوع‌ طرح‌، مورد توجه‌ قرار گرفت‌. در سال‌هاي‌ بعد، مركز آمار ايران‌ ضمن‌ اجراي‌ سرشماري‌هاي‌ عمومي‌ نفوس‌ و مسكن‌ سال‌هاي‌ 1345، 1355، 1365، 1375، 1385 و آمارگيري‌ جاري‌ جمعيت‌ 1370، آمار و اطلاعات‌ اساسي‌ مربوط به‌ نيـروي‌ انـساني‌ را جـمع‌آوري‌ نموده و علاوه‌ بر آن‌ از سال‌ 1376، طرح‌ نمونه‌گيري‌ ويژگي‌هاي‌ اشتغال‌ و بيكاري‌ خانوار را نيز به اجرا درآورده است و تا سال 1383 هر سال اين طرح اجرا گرديده، در سال‌هاي مذكور اطلاعات آبان ماه به عنوان نماينده سال ارائه شده است. از سال 1384 طرح آمارگيري از نيروي كار جايگزين طرح مذكور گرديده است، شايان ذكر است با توجه به ويژگي‌‌هاي اين طرح، اطلاعات ارائه شده در اين سال‌ها متوسط اطلاعات سالانه مي‌باشد.

  براي‌ تهيه‌ و تنظيم‌ آمار و اطلاعات‌ اين‌ قسمت‌، از نتايج‌ طرح‌ آمار‌گيري از‌ ويژگي‌هاي‌ اشتغال‌ و بيكاري‌ خانوار و طرح آمارگيري از نيروي كار مركز آمار ايران‌ و نيز از گزارش‌هاي‌ آماري‌ سازمان امور اداری و استخدامی استفاده‌ شده‌ است‌.

در مورد آمار ارائه‌ شده‌ توضيح‌ نكات‌ زير ضروري‌ است:

1- در طرح‌ آمارگيري‌ از ويژگي‌هاي‌ اشتغال‌ و بيكاري‌ خانوار و همچنين طرح آمارگيري از نيـروي كار، جـامعه آماري‌ نمونه‌ فقط‌

شامل‌ خانوارهاي‌ معمولي‌ ساكن‌ مي‌باشد و خانوارهاي‌ دستجمعي‌ و معمولي‌ غير ساكن‌ را  در بر نمي‌گيرد.

2- آمار مربوط به‌ هر وزارتخانه‌ يا مؤسسه‌، شامل‌ آمار تمامي  سازمان‌ها و واحدهاي‌ تحت‌ پوشش‌ آن نيز مي‌باشد.

3- آمار كاركنان‌ وزارت‌ اطلاعات‌، وزارت‌ دفاع‌ و پشتيباني‌ نيروهاي‌ مسلح‌ و شركت‌هاي‌ وابسته‌ به‌ آن‌ و نيروهاي‌ نظامي‌ و انتظامي‌، به‌‌دليل‌ محرمانه‌ بودن‌ و نيز آمار كاركنان‌ شركت‌هاي‌ تحت‌ پوشش‌ سازمان‌هاي‌ دولتي‌ به‌ علت‌ وضعيت‌ خاص‌ استخدامي‌، در دسترس‌ نمي‌باشد.

                براي اطلاع از تعاريف و مفاهيم آماري مرتبط با موضوع، مي‌توانيد از منابع زير استفاده نماييد:

۱. سامانه ملي تعاريف و مفاهيم آماري
۲. تعاريف و مفاهيم موجود در ابتداي هر نشريه يا چكيده مربوط به نتايج طرح‌هاي آمارگيري
۳. تعاريف و مفاهيم موجود در ابتداي هر فصل از سالنامه آماري كشور يا استان‌ها (قابل دسترسي از طريق سامانه سالنامه آماري)
۴. نشريه تعاریف و مفاهیم استاندارد آماری برای استفاده در طرح‌ها و گزارش‌های آماری - ویرایش سوم
۵. مستندات طرح‌ها و سرشماري‌هاي مرتبط با موضوع
نكته: تعاريف و مفاهيم آماري در گذر زمان ممكن است تغيير نمايد، لذا پيش از استفاده از آمارها حتماً اين مسأله را مورد توجه قرار دهيد.

طبقه‌بندی مشاغل ایران mapicon (١٣٩٩/٠٢/٠٨)
طبقه‌بندی استاندارد مشاغل ایران - ۱۳۹۵ (بر اساس طبقه‌بندی استاندارد بین‌المللی مشاغل ISCO-٢٠٠٨) pdficon (١٣٩٥/٠٩/٠٢)
طبقه‌بندی استاندارد بين‌المللی مشاغل (ISCO-٠٨)، ساختار، تعاريف گروه‌ها، جداول تطبيقی و فهرست مصاديق pdficon (١٣٨٧/٠١/٠١)
طبقه‌بندي مشاغل ایران، نسخه سال ۱۹۸۸ pdficon (١٣٧٠/٠١/٠١)
                """)

        with c2tab4:
            st.image("https://static.streamlit.io/examples/cat.jpg", width=200)

        with c2tab5:
            st.image("https://static.streamlit.io/examples/cat.jpg", width=200)

with tab2:
#    st.header("بازار کار")
#    st.image("https://static.streamlit.io/examples/cat.jpg", width=200)

    t2col1, t2col2 = st.columns([1, 5])

    with t2col1:
        with st.expander("شاخص ها"):
            st.write("sfsf")
            st.write("sfsf")
            st.write("sfsf")
            st.write("sfsf")

        with st.expander("استان"):
            t2Tickers = [
                'ETH-USD',
                'TSLA',
                'BTC-USD',
                "آذربایجان شرقی",
                "آذربایجان غربی",
                "اردبیل",
                "اصفهان",
                "البرز",
                "ایلام",
                "بوشهر",
                "تهران ",
                "چهارمحال و بختیاری",
                "خراسان جنوبی",
                "خراسان رضوی",
                "خراسان شمالی",
                "خوزستان",
                "زنجان",
                "سمنان",
                "سیستان و بلوچستان",
                "فارس",
                "قزوین",
                "قم",
                "کردستان",
                "کرمان",
                "کرمانشاه",
                "کهگیلویه و بویراحمد",
                "گلستان",
                "گیلان",
                "لرستان",
                "مازندران",
                "مرکزی",
                "هرمزگان",
                "همدان",
                "یزد"]
            t2dropdown = st.multiselect(
                'استان یا استان های مورد نظر خود را انتحاب کنید',
                t2Tickers, key=2)

        with st.expander("زمان"):
            start = st.date_input('از تاریخ',
                                  value=pd.to_datetime('2022-01-01'),
                                  key ='st2')
            end = st.date_input('تا تاریخ',
                                value=pd.to_datetime('today'),
                                key = 'et2')

        with st.expander("سبد علایق کاربر"):
            st.write("sfsf")
            st.write("sfsf")

        with st.expander("محاسبه شاخص های جدید"):
            st.write("sfsf")
            st.write("sfsf")

    with t2col2:
        t2c2tab1, t2c2tab2, t2c2tab3, t2c2tab4, t2c2tab5 = st.tabs([
            "نمودار", "جدول", "فراداده ها", "گزینه های دانلود" ,
            "اشتراک گزاری" ])

        with t2c2tab1:
            if len(t2dropdown) > 0:
                df = yf.download(t2dropdown, start, end)['Close']
                st.line_chart(df)

        with t2c2tab2:
            if len(t2dropdown) > 0:
                data = yf.download(t2dropdown, start, end)
                st.table(data)

        with t2c2tab3:
#st.image("https://static.streamlit.io/examples/owl.jpg", width=200)
            st.write(
                """
                صنعت:

 اطلاعات قابل ارائه در این بخش شامل: کارگاه‌های صنعتی برحسب تعداد نفرات شاغل درآن‌ها، کارگاه‌های تولید کننده محصولات برحسب نوع، شاغلان دراین کارگاه‌ها برحسب جنس و سن، ارزش افزوده تولیدی این کارگاه‌ها، ظرفیت تولید، میزان سرمایه گذاری و .. می باشد.

اولين‌ سرشماري‌ صنعتي‌ كشور، در مرداد ماه‌ 1342 به‌ وسيله اداره‌ كل‌ آمار عمومي‌ وقت‌ انجام‌ گرفت‌. از سال‌ 1343 تا سال 1351، وزارت‌ اقتصاد وقت‌ به‌ تهيه‌ آمار از كارگاه‌ها‌‌‌ي‌ صنعتي‌ كشور مبادرت‌ ‌نمود و از سال‌ 1352 به‌ بعد، اين‌ وظيفه‌ به‌ وزارت‌ صنايع‌ و معادن‌ وقت‌ محول‌ شد.

     مركز آمار ايران‌ در سال‌ 1351، براي‌ اولين‌ بار از كارگاه‌ها‌‌‌ي‌ بزرگ‌ صنعتي‌ (10 نفر كاركن‌ و بيش‌تر) سرشماري‌ به ‌عمل‌ آورد و از آن‌ سال‌ تا سال‌ 1366، اين‌ سرشماري‌ را همه‌ ساله‌ بجز سال‌ها‌‌‌ي‌ 1356 و 1357 به‌ انجام‌ رسانيد.

     بر اثر تغييرات‌ حاصل‌ در بافت‌ صنعتي‌ كشور و ضرورت‌ بررسي‌ آماري‌ كل‌ كارگاه‌ها‌‌‌ي‌ صنعتي‌، مركز آمار ايران‌ در سال‌ 1367، طرح‌ جامع‌ آمارگيري‌ صنعتي‌ را تهيه‌ و به‌ مرحله اجرا درآورد که اجراي‌ اين‌ طرح‌ با  انجـام‌ تغييراتي‌، تا  سال‌1370 نيز ادامه‌ يافت‌.

     با توجه‌ به‌ اين‌ امر كه‌ قسمت‌ اعظم‌ توليد بخـش‌ صنعت‌، مربوط به‌ كارگاه‌ها‌‌‌ي‌ بزرگ‌ صنعتي‌ (10 نفر كاركن‌ و بيش‌تر) است‌، مـركز آمار ايران‌ مجدداً  اجـراي‌ طــرح آمــارگيـري‌ از كارگاه‌ها‌‌‌ي‌ بـزرگ‌ صنعتـي‌ را در ســال‌ 1371 آغاز كرد كه‌ در سـال‌ها‌‌‌ي‌ 1372 و 1373 نيــز ادامـه‌ يافت‌. همچنيـن‌ در ســال‌ 1373،  ايـن‌ مـركـز طـرح‌ سـرشماري‌ عمـومي ‌صنعت‌ و معدن‌ را به‌ مرحله اجرا در آورد.

از سال‌ 1377، سرشماري‌ از كارگاه‌ها‌‌‌ي‌ صنعتي‌ داراي 10‌ نفر كاركن‌ و بيش‌تر هر سال‌ انجام‌ مي‌شود و اطلاعات‌ تـفصيلي‌ سـال‌ قبل‌ كارگاه‌ها‌‌‌ي‌ مذكور، برحسب‌ فعاليت‌ها‌‌‌ي‌ مختلف‌ صنعتي‌ جمع‌آوري‌ و منتشر مي‌گردد. در سال 1381، طرح سرشماري عمومي‌كارگاهي با هدف‌ جمع‌آوري‌ اطلاعات‌ چارچوبي‌ فعاليت‌ها‌‌‌ي‌ اقتصادي‌ كشـور اعم‌ از كارگاه‌ها‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌ و خانوارها‌‌‌، نیز انجام شد.

در سال‌ها‌‌‌ي بعد نيز بـا استفـاده از چـارچـوب بـه دسـت آمده از سرشماري عمومي‌كارگاهي 1381، كارگاه‌ها‌‌‌ي داراي 10 نفر كاركن و بيش‌تر با روش سرشماري مورد آمارگيري قرار گرفت. گردآوري‌ آمار مشخصات‌ اجازه‌‌نامه‌ها‌‌‌ي‌ جديد صنعتي‌، فعاليت‌ آماري‌ ديگري‌ است‌ كه‌ از شروع‌ فعاليت‌ها‌‌‌ي‌ آماري‌ وزارت‌ صنايع‌ و معادن تاكنون،‌ به‌ طور مستمر انجام‌ مي‌شود.

     ذكر اين‌ نكته‌ ضروری است كه‌ براي‌ طبقه‌بندي‌ فعاليت‌ها‌‌‌ي‌ بخش‌ صنعت‌، از ويرايش‌ سوم‌ طبقه‌بندي‌ بين‌المللي‌ فعاليت‌ها‌‌‌ي‌ اقتصادي (ISIC)، با اعمـال‌ تغييراتي‌ در آن استفاده شده‌ است‌.

براي اطلاع از تعاريف و مفاهيم آماري مرتبط با موضوع، مي‌توانيد از منابع زير استفاده نماييد:

۱. سامانه ملي تعاريف و مفاهيم آماري
۲. تعاريف و مفاهيم موجود در ابتداي هر نشريه يا چكيده مربوط به نتايج طرح‌هاي آمارگيري
۳. تعاريف و مفاهيم موجود در ابتداي هر فصل از سالنامه آماري كشور يا استان‌ها (قابل دسترسي از طريق سامانه سالنامه آماري)
۴. نشريه تعاریف و مفاهیم استاندارد آماری برای استفاده در طرح‌ها و گزارش‌های آماری - ویرایش سوم
۵. مستندات طرح‌ها و سرشماري‌هاي مرتبط با موضوع
نكته: تعاريف و مفاهيم آماري در گذر زمان ممكن است تغيير نمايد، لذا پيش از استفاده از آمارها حتماً اين مسأله را مورد توجه قرار دهيد.

طبقه‌بندی فعالیت‌های اقتصادی، نسخه ٤ mapicon (١٣٩٩/٠٢/٠٨)
طبقه‌بندی استاندارد بين‌المللی تمامی رشته فعاليت‌های اقتصادی (ISIC)، بازنگری چهارم pdficon (١٣٨٧/٠١/٠١)
طبقه‌بندی فعاليت‌های اقتصادی ايران (بر اساس ISIC, Rev٤) pdficon (١٣٨٧/٠١/٠١)
طبقه‌بندی فعاليت‌های اقتصادی ايران (بر اساس ISIC, Rev٣,١) pdficon (١٣٨٥/٠١/٠١)
طبقه‌بندي بين‌المللي محوري محصولات ايران (۲-CPC) pdficon (١٣٩٤/٠١/٠١)
طبقه بندي محوري محصولات ایران براساس CPC,Rev٢ - جلد اول pdficon (١٣٩٤/٠٤/٠١)
طبقه بندي محوري محصولات ایران براساس CPC,Rev٢ - جلد دوم pdficon (١٣٩٤/٠٤/٠١)
                """)

        with t2c2tab4:
            st.image("https://static.streamlit.io/examples/cat.jpg", width=200)

        with t2c2tab5:
            st.image("https://static.streamlit.io/examples/cat.jpg", width=200)

with tab3:
#    st.header("بازار کار")
#    st.image("https://static.streamlit.io/examples/cat.jpg", width=200)

    t3col1, t3col2 = st.columns([1, 5])

    with t3col1:
        with st.expander("شاخص ها"):
            st.write("sfsf")
            st.write("sfsf")
            st.write("sfsf")
            st.write("sfsf")

        with st.expander("استان"):
            t3Tickers = [
                'ETH-USD',
                'TSLA',
                'BTC-USD',
                "آذربایجان شرقی",
                "آذربایجان غربی",
                "اردبیل",
                "اصفهان",
                "البرز",
                "ایلام",
                "بوشهر",
                "تهران ",
                "چهارمحال و بختیاری",
                "خراسان جنوبی",
                "خراسان رضوی",
                "خراسان شمالی",
                "خوزستان",
                "زنجان",
                "سمنان",
                "سیستان و بلوچستان",
                "فارس",
                "قزوین",
                "قم",
                "کردستان",
                "کرمان",
                "کرمانشاه",
                "کهگیلویه و بویراحمد",
                "گلستان",
                "گیلان",
                "لرستان",
                "مازندران",
                "مرکزی",
                "هرمزگان",
                "همدان",
                "یزد"]
            t3dropdown = st.multiselect(
                'استان یا استان های مورد نظر خود را انتحاب کنید',
                t3Tickers, key=3)

        with st.expander("زمان"):
            start = st.date_input('از تاریخ',
                                  value=pd.to_datetime('2022-01-01'),
                                  key = 'st3')
            end = st.date_input('تا تاریخ',
                                value=pd.to_datetime('today'),
                                key = 'et3')

        with st.expander("سبد علایق کاربر"):
            st.write("sfsf")
            st.write("sfsf")

        with st.expander("محاسبه شاخص های جدید"):
            st.write("sfsf")
            st.write("sfsf")

    with t3col2:
        t3c2tab1, t3c2tab2, t3c2tab3, t3c2tab4, t3c2tab5 = st.tabs([
            "نمودار", "جدول", "فراداده ها", "گزینه های دانلود" ,
            "اشتراک گزاری" ])

        with t3c2tab1:
            if len(t3dropdown) > 0:
                df = yf.download(t3dropdown, start, end)['Close']
                st.line_chart(df)

        with t3c2tab2:
            if len(t3dropdown) > 0:
                data = yf.download(t3dropdown, start, end)
                st.table(data)

        with t3c2tab3:
#st.image("https://static.streamlit.io/examples/owl.jpg", width=200)
            st.write(
                """
صادرات و واردات:

دراین بخش اطلاعاتی مانند: میزان تراز بازرگانی خارجی کشور، مقدار و ارزش واردات کشور برحسب تعرفه های گمرکی، مقدار و ارزش صادرات کشور برحسب تعرفه های گمرکی، میزان ارزش صادرات به کشورهای مقصد و... ارائه می شود.

آمار بازرگاني‌ خـارجي‌ ايران‌ از سـال‌ 1279 به‌ طور مستمر منتشر مي‌شود. آمار مذكور، سالانه‌ بر مبناي‌ اطلاعات‌ مندرج‌ در اظهارنامه‌هاي‌ ورودي‌ و خروجي‌ كالاهاي‌ تر‌خيص‌ شده‌ قطعي‌ از گمركات‌‌‌ كشور، توسط گمرك‌‌ جمهوري ‌اسلامي‌ ايران‌ تهيه ‌مي‌شود.

                براي اطلاع از تعاريف و مفاهيم آماري مرتبط با موضوع، مي‌توانيد از منابع زير استفاده نماييد:

۱. سامانه ملي تعاريف و مفاهيم آماري
۲. تعاريف و مفاهيم موجود در ابتداي هر نشريه يا چكيده مربوط به نتايج طرح‌هاي آمارگيري
۳. تعاريف و مفاهيم موجود در ابتداي هر فصل از سالنامه آماري كشور يا استان‌ها (قابل دسترسي از طريق سامانه سالنامه آماري)
۴. نشريه تعاریف و مفاهیم استاندارد آماری برای استفاده در طرح‌ها و گزارش‌های آماری - ویرایش سوم
۵. مستندات طرح‌ها و سرشماري‌هاي مرتبط با موضوع
نكته: تعاريف و مفاهيم آماري در گذر زمان ممكن است تغيير نمايد، لذا پيش از استفاده از آمارها حتماً اين مسأله را مورد توجه قرار دهيد.
                """)

        with t3c2tab4:
            st.image("https://static.streamlit.io/examples/cat.jpg", width=200)

        with t3c2tab5:
            st.image("https://static.streamlit.io/examples/cat.jpg", width=200)

with tab4:
#    st.header("بازار کار")
#    st.image("https://static.streamlit.io/examples/cat.jpg", width=200)

    t4col1, t4col2 = st.columns([1, 5])

    with t4col1:
        with st.expander("شاخص ها"):
            st.write("sfsf")
            st.write("sfsf")
            st.write("sfsf")
            st.write("sfsf")

        with st.expander("استان"):
            t4Tickers = [
                'ETH-USD',
                'TSLA',
                'BTC-USD',
                "آذربایجان شرقی",
                "آذربایجان غربی",
                "اردبیل",
                "اصفهان",
                "البرز",
                "ایلام",
                "بوشهر",
                "تهران ",
                "چهارمحال و بختیاری",
                "خراسان جنوبی",
                "خراسان رضوی",
                "خراسان شمالی",
                "خوزستان",
                "زنجان",
                "سمنان",
                "سیستان و بلوچستان",
                "فارس",
                "قزوین",
                "قم",
                "کردستان",
                "کرمان",
                "کرمانشاه",
                "کهگیلویه و بویراحمد",
                "گلستان",
                "گیلان",
                "لرستان",
                "مازندران",
                "مرکزی",
                "هرمزگان",
                "همدان",
                "یزد"]
            t4dropdown = st.multiselect(
                'استان یا استان های مورد نظر خود را انتحاب کنید',
                t4Tickers, key=4)

        with st.expander("زمان"):
            start = st.date_input('از تاریخ',
                                  value=pd.to_datetime('2022-01-01'),
                                  key = 'st4')
            end = st.date_input('تا تاریخ',
                                value=pd.to_datetime('today'),
                                key = 'et4')

        with st.expander("سبد علایق کاربر"):
            st.write("sfsf")
            st.write("sfsf")

        with st.expander("محاسبه شاخص های جدید"):
            st.write("sfsf")
            st.write("sfsf")

    with t4col2:
        t4c2tab1, t4c2tab2, t4c2tab3, t4c2tab4, t4c2tab5 = st.tabs([
            "نمودار", "جدول", "فراداده ها", "گزینه های دانلود" ,
            "اشتراک گزاری" ])

        with t4c2tab1:
            if len(t4dropdown) > 0:
                df = yf.download(t4dropdown, start, end)['Close']
                st.line_chart(df)

        with t4c2tab2:
            if len(t4dropdown) > 0:
                data = yf.download(t4dropdown, start, end)
                st.table(data)

        with t4c2tab3:
#st.image("https://static.streamlit.io/examples/owl.jpg", width=200)
            st.write(
                """
                هزینه و درآمد خانوارهای کل کشور:

 دراین بخش اطلاعاتی شامل میزان توزیع درآمد خانوارهای شهری، روستایی و کل کشور، به تفکیک استانی ارائه شده و جداول اطلاعاتی موضوعات مذکور قابل دسترسی است. همچنین اطلاعات ضریب جینی نیز در این بخش ارائه می شود. با ذکر این نکته که ضریب جینی يكي از شاخص هاي سنجش نابرابري درامدجامعه است و عددي است بين صفر و يك كه در آن صفر به معني توزيع كاملا برابر درامديا ثروت و يك به معناي نابرابري مطلق در توزيع درآمدی است.

نشریات موجود در این بخش  در دوره های زمانی متفاوت  منتشر شده و دراختیار کاربران قرار میگیرد.

براي اطلاع از تعاريف و مفاهيم آماري مرتبط با موضوع، مي‌توانيد از منابع زير استفاده نماييد:

۱. سامانه ملي تعاريف و مفاهيم آماري
۲. تعاريف و مفاهيم موجود در ابتداي هر نشريه يا چكيده مربوط به نتايج طرح‌هاي آمارگيري
۳. تعاريف و مفاهيم موجود در ابتداي هر فصل از سالنامه آماري كشور يا استان‌ها (قابل دسترسي از طريق سامانه سالنامه آماري)
۴. نشريه تعاریف و مفاهیم استاندارد آماری برای استفاده در طرح‌ها و گزارش‌های آماری - ویرایش سوم
۵. مستندات طرح‌ها و سرشماري‌هاي مرتبط با موضوع
نكته: تعاريف و مفاهيم آماري در گذر زمان ممكن است تغيير نمايد، لذا پيش از استفاده از آمارها حتماً اين مسأله را مورد توجه قرار دهيد.
                """)

        with t4c2tab4:
            st.image("https://static.streamlit.io/examples/cat.jpg", width=200)

        with t4c2tab5:
            st.image("https://static.streamlit.io/examples/cat.jpg", width=200)
